In [3]:
import pandas as pd
df = pd.read_csv("202101_BolsaFamilia_Pagamentos.csv", encoding="latin1", sep=";")

In [10]:
df.describe()

       MÊS COMPETÊNCIA  MÊS REFERÊNCIA  CÓDIGO MUNICÍPIO SIAFI  NIS FAVORECIDO
count       14233116.0    1.423312e+07            1.423312e+07    1.423312e+07
mean          202101.0    2.021010e+05            3.657725e+03    1.723111e+10
std                0.0    4.878152e-01            2.735140e+03    3.236787e+09
min           202101.0    2.020080e+05            1.000000e+00    1.000053e+10
25%           202101.0    2.021010e+05            1.347000e+03    1.605058e+10
50%           202101.0    2.021010e+05            3.105000e+03    1.643242e+10
75%           202101.0    2.021010e+05            5.891000e+03    2.033730e+10
max           202101.0    2.021010e+05            9.997000e+03    2.389491e+10

In [19]:
try:
    df['VALOR PARCELA'] = df['VALOR PARCELA'].apply(lambda x : float(x.replace(",", ".")))
except:
    pass
df['VALOR PARCELA']

0           212.0
1           212.0
2           253.0
3            89.0
4           130.0
            ...
14233111    130.0
14233112    130.0
14233113     89.0
14233114     89.0
14233115    342.0
Name: VALOR PARCELA, Length: 14233116, dtype: float64

In [20]:
df.columns

Index(['MÊS COMPETÊNCIA', 'MÊS REFERÊNCIA', 'UF', 'CÓDIGO MUNICÍPIO SIAFI',
       'NOME MUNICÍPIO', 'CPF FAVORECIDO', 'NIS FAVORECIDO', 'NOME FAVORECIDO',
       'VALOR PARCELA'],
      dtype='object')

In [21]:
df[['UF', 'NOME MUNICÍPIO', 'VALOR PARCELA']].to_csv("tabela_pbf.csv")

In [1]:
import pandas as pd
df = pd.read_csv("tabela_pbf.csv")

In [2]:
df.columns
df.drop("Unnamed: 0", axis = 1, inplace=True)
df

          UF            NOME MUNICÍPIO  VALOR PARCELA
0         AM          ATALAIA DO NORTE          212.0
1         AM                     BORBA          212.0
2         AM  SAO GABRIEL DA CACHOEIRA          253.0
3         AP          LARANJAL DO JARI           89.0
4         BA                    CURACA          130.0
...       ..                       ...            ...
14233111  TO                   XAMBIOA          130.0
14233112  TO                   XAMBIOA          130.0
14233113  TO                   XAMBIOA           89.0
14233114  TO                   XAMBIOA           89.0
14233115  TO                   XAMBIOA          342.0

[14233116 rows x 3 columns]

In [3]:
df_mg = df.loc[df["UF"] == "MG"]
df_udi = df_mg.loc[df_mg['NOME MUNICÍPIO'] == 'UBERLANDIA']
df_udi['VALOR PARCELA']
df_udi.loc

In [11]:
valorPorUf = df.groupby("UF")["VALOR PARCELA"].sum()
valorPorUf

UF
AC     24615319.0
AL     79264819.0
AM     94143351.0
AP     17510169.0
BA    345389404.0
CE    205459232.0
DF     15207244.0
ES     35252025.0
GO     50343980.0
MA    203917395.0
MG    199432460.0
MS     24296741.0
MT     28194748.0
PA    193716793.0
PB    105263068.0
PE    217729662.0
PI     95750998.0
PR     65157000.0
RJ    175289914.0
RN     68670112.0
RO     12985213.0
RR     11252137.0
RS     66917501.0
SC     23362168.0
SE     49121391.0
SP    281299222.0
TO     22833534.0
Name: VALOR PARCELA, dtype: float64

In [22]:
valorPorUf.loc[valorPorUf == valorPorUf.max()]

UF
BA    345389404.0
Name: VALOR PARCELA, dtype: float64

In [23]:
valorPorUf.sort_values().tail(5)

UF
MA    203917395.0
CE    205459232.0
PE    217729662.0
SP    281299222.0
BA    345389404.0
Name: VALOR PARCELA, dtype: float64

In [38]:
valorporUfeMuni = df.groupby(['UF', 'NOME MUNICÍPIO'])["VALOR PARCELA"].sum()
valorporUfeMuni["MG"].sort_values(ascending=False)[:15]

NOME MUNICÍPIO
BELO HORIZONTE          11765588.0
BETIM                    5484780.0
CONTAGEM                 4547722.0
RIBEIRAO DAS NEVES       3470985.0
SANTA LUZIA              3301469.0
JUIZ DE FORA             2758780.0
IPATINGA                 2463873.0
UBERLANDIA               2318617.0
MONTES CLAROS            2197325.0
JANUARIA                 2010938.0
GOVERNADOR VALADARES     1933557.0
IBIRITE                  1737184.0
SAO FRANCISCO            1598994.0
JAIBA                    1424359.0
TEOFILO OTONI            1374755.0
Name: VALOR PARCELA, dtype: float64

In [46]:
notas = pd.read_excel("Notas.xlsx")
notas

      Nome  Matemática  História  Geografia
0    Maria         NaN      85.0       90.0
1    Pedro        75.0       NaN       97.0
2      Ana        62.0      87.0       78.0
3     Luís        55.0      52.0       96.0
4  Beatriz         NaN      86.0        NaN

In [47]:
notas.dropna()

   Nome  Matemática  História  Geografia
2   Ana        62.0      87.0       78.0
3  Luís        55.0      52.0       96.0

In [49]:
notas.fillna(0, inplace=True)
notas

      Nome  Matemática  História  Geografia
0    Maria         0.0      85.0       90.0
1    Pedro        75.0       0.0       97.0
2      Ana        62.0      87.0       78.0
3     Luís        55.0      52.0       96.0
4  Beatriz         0.0      86.0        0.0

In [50]:
notas = pd.read_excel("Notas.xlsx")
notas

      Nome  Matemática  História  Geografia
0    Maria         NaN      85.0       90.0
1    Pedro        75.0       NaN       97.0
2      Ana        62.0      87.0       78.0
3     Luís        55.0      52.0       96.0
4  Beatriz         NaN      86.0        NaN

In [53]:
notas.mean()
notas.fillna(notas.mean())

C:\Users\scync\AppData\Local\Temp/ipykernel_19224/3676496184.py:1: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  notas.mean()
C:\Users\scync\AppData\Local\Temp/ipykernel_19224/3676496184.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  notas.fillna(notas.mean())

      Nome  Matemática  História  Geografia
0    Maria        64.0      85.0      90.00
1    Pedro        75.0      77.5      97.00
2      Ana        62.0      87.0      78.00
3     Luís        55.0      52.0      96.00
4  Beatriz        64.0      86.0      90.25

In [62]:
import random
inicial = 1
final = 61
pesos = [50 + random.randint(20,49) for _ in range(inicial, final)]
idades = [random.randint(18,75) for i in range(inicial, final)]
salarios = [1000 + random.randint(18,75) * 100 for i in range(inicial, final)]

pacientes = pd.DataFrame(list(zip(pesos, idades, salarios)), columns = ['pesos', 'idades', 'salarios'])
pacientes.corr()

             pesos    idades  salarios
pesos     1.000000 -0.043766 -0.037580
idades   -0.043766  1.000000  0.002644
salarios -0.037580  0.002644  1.000000

In [42]:
df1 = pd.DataFrame({'A' : ['A0', 'A1', 'A2', 'A3'],
                    'B' : ['B0', 'B1', 'B2', 'B3']}, 
                    index = ['K0', 'K1', 'K2', 'K3'])

df2 = pd.DataFrame({'C' : ['C0', 'C1', 'C2', 'C3'],
                    'D' : ['D0', 'D1', 'D2', 'D3']}, 
                    index = ['K0', 'K2', 'K3', 'K4'])

df1

     A   B
K0  A0  B0
K1  A1  B1
K2  A2  B2
K3  A3  B3

In [45]:
df_total = pd.concat([df1, df2], axis = 1)
df_total

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3   A3   B3   C2   D2
K4  NaN  NaN   C3   D3

In [52]:
resultado = pd.merge(df1, df2, right_index=True, left_index=True)
resultado

     A   B   C   D
K0  A0  B0  C0  D0
K2  A2  B2  C1  D1
K3  A3  B3  C2  D2

In [57]:
resultado_join = df1.join(df2, how="outer")
resultado_join

      A    B    C    D
K0   A0   B0   C0   D0
K1   A1   B1  NaN  NaN
K2   A2   B2   C1   D1
K3   A3   B3   C2   D2
K4  NaN  NaN   C3   D3